In [55]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis_kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
display(df)

    siswa_id   pelajaran  nilai jenis_kelamin kelas
0          1     Biologi     96     perempuan   12B
1          2      Fisika     11     perempuan   12D
2          3     Ekonomi     37     laki-laki   12C
3          4     Ekonomi     23     perempuan   12B
4          5      Fisika     60     perempuan   12D
5          6      Fisika     35     laki-laki   12C
6          7       Kimia     59     laki-laki   12A
7          8     Geologi     57     perempuan   12A
8          9  Matematika     18     perempuan   12B
9         10     Geologi     24     laki-laki   12D
10        11     Geologi     86     laki-laki   12B
11        12     Ekonomi     59     perempuan   12D
12        13     Ekonomi     30     laki-laki   12C
13        14       Kimia     12     perempuan   12B
14        15      Fisika     41     laki-laki   12A
15        16      Fisika     47     laki-laki   12C
16        17      Fisika     76     perempuan   12C
17        18     Geologi      4     laki-laki   12D
18        19  Matematika     40     perempuan   12C
19        20     Ekonomi     53     perempuan   12B

In [57]:
# <h2>Soal 1: Indexing</h2>

# 1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
# 2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai
# jawab
col_kelas=df.loc[0:,['nilai','kelas']]
display(col_kelas)
baris_5_10=df.iloc[5:11,[1,2]]
display(baris_5_10)

    nilai kelas
0      96   12B
1      11   12D
2      37   12C
3      23   12B
4      60   12D
5      35   12C
6      59   12A
7      57   12A
8      18   12B
9      24   12D
10     86   12B
11     59   12D
12     30   12C
13     12   12B
14     41   12A
15     47   12C
16     76   12C
17      4   12D
18     40   12C
19     53   12B

     pelajaran  nilai
5       Fisika     35
6        Kimia     59
7      Geologi     57
8   Matematika     18
9      Geologi     24
10     Geologi     86

In [56]:
# <h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

# 1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
# 2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
# 3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C
matkul_eko=df.pelajaran=='Ekonomi'
matkul_Fis=df.pelajaran=='Fisika'
display(df[(matkul_eko | matkul_Fis)])
matkul_kim=df.pelajaran=='Kimia'
nilai_lebih=df.nilai > 50
display(df[matkul_kim & nilai_lebih])
nilai_lebih_70=df.nilai>70
cewek=df.jenis_kelamin=='perempuan'
kelas=df.kelas=='12C'
display(df[(nilai_lebih_70 & (cewek & kelas))])

    siswa_id pelajaran  nilai jenis_kelamin kelas
1          2    Fisika     11     perempuan   12D
2          3   Ekonomi     37     laki-laki   12C
3          4   Ekonomi     23     perempuan   12B
4          5    Fisika     60     perempuan   12D
5          6    Fisika     35     laki-laki   12C
11        12   Ekonomi     59     perempuan   12D
12        13   Ekonomi     30     laki-laki   12C
14        15    Fisika     41     laki-laki   12A
15        16    Fisika     47     laki-laki   12C
16        17    Fisika     76     perempuan   12C
19        20   Ekonomi     53     perempuan   12B

   siswa_id pelajaran  nilai jenis_kelamin kelas
6         7     Kimia     59     laki-laki   12A

    siswa_id pelajaran  nilai jenis_kelamin kelas
16        17    Fisika     76     perempuan   12C

In [62]:
# <h2>Soal 3: Data Transformation</h2>

# lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

# ![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)
def normalisasi(x):
    return (x-x.min())/(x.max()-x.min())
df['nilai']=normalisasi(df['nilai'])
display('setelah melakukan proses normalisasi: ',df)

'setelah melakukan proses normalisasi: '

    siswa_id   pelajaran     nilai jenis_kelamin kelas
0          1     Biologi  1.000000     perempuan   12B
1          2      Fisika  0.076087     perempuan   12D
2          3     Ekonomi  0.358696     laki-laki   12C
3          4     Ekonomi  0.206522     perempuan   12B
4          5      Fisika  0.608696     perempuan   12D
5          6      Fisika  0.336957     laki-laki   12C
6          7       Kimia  0.597826     laki-laki   12A
7          8     Geologi  0.576087     perempuan   12A
8          9  Matematika  0.152174     perempuan   12B
9         10     Geologi  0.217391     laki-laki   12D
10        11     Geologi  0.891304     laki-laki   12B
11        12     Ekonomi  0.597826     perempuan   12D
12        13     Ekonomi  0.282609     laki-laki   12C
13        14       Kimia  0.086957     perempuan   12B
14        15      Fisika  0.402174     laki-laki   12A
15        16      Fisika  0.467391     laki-laki   12C
16        17      Fisika  0.782609     perempuan   12C
17        18     Geologi  0.000000     laki-laki   12D
18        19  Matematika  0.391304     perempuan   12C
19        20     Ekonomi  0.532609     perempuan   12B